---
kind: type
id: T:Autodesk.Revit.DB.SelectionFilterElement
source: html/b0aaf230-e034-8466-c1e4-1d91e7162d19.htm
---
# Autodesk.Revit.DB.SelectionFilterElement

A filter element that stores an explicit list of ElementIds.
 Only elements whose ElementIds are in this list will pass the filter.

## Syntax (C#)
```csharp
public class SelectionFilterElement : FilterElement
```